import { DICTIONARY } from "./dict";
import { ROUTES } from "./routes.config";

export const GRADES =[
  {
    title: DICTIONARY.grade1,
    image: "/grade1.png",
    link: `${ROUTES.grade}/grade1`,
  },
  {
    title: DICTIONARY.grade2,
    image: "/grade2.jpg",
    link: `${ROUTES.grade}/grade2`,
  },
];

export const emailData = {
  SERVICE_ID: "service_unngepu",
  TEMPLATE_ID: "template_h8c3pwo",
  PUBLIC_KEY: "WLLchEtov0gfiAxOv",
};
export const EMAIL = "Oueslatimariem54@gmail.com";

export const CREATORS = [
  {
    name: "مريم  الوسلاتي",
    image: "/creator1.jpg",
  },
  {
    name: "آمنة الطالبي",
    image: "/creator2.jpg",
  },
];
export const EXERCICES = {
  grade1: [
    {
      title: "	الذاكرة",
      image: "/exercices/grade1/exercice1.png",
    },
    {
      title: "	احيط المجموعات ",
      image: "/exercices/grade1/exercice2.png",
    },
    {
      title: "	الون في كل مرة ",
      image: "/exercices/grade1/exercice3.png",
    },
  ],
  grade2: [
    {
      title: "اضيف المتعة",
      image: "/exercices/grade2/exercice1.png",
    },
    {
      title: "هيا نقارن معا ",
      image: "/exercices/grade2/exercice2.png",
    },
    {
      title: "متاهة الطرح ",
      image: "/exercices/grade2/exercice3.png",
    },
  ],
};
export const COURSES = {
  grade1: [
    {
      title: "تعيين موقع شيء في الفضاء",
      image: "/courses/grade1/course1.png",
    },
    {
      title: "تكوين مجموعة بصفة تلقائية ",
      image: "/courses/grade1/course2.png",
    },
    {
      title: "الجمع ",
      image: "/courses/grade1/course3.png",
    },
  ],
  grade2: [
    {
      title: "الجمع بالاحتفاظ ومن دونه",
      image: "/courses/grade2/course1.png",
    },
    {
      title: "المقارنة والترتيب ",
      image: "/courses/grade2/course2.png",
    },
    {
      title: "الطرح دون زيادة ولا تفكيك ",
      image: "/courses/grade2/course3.png",
    },
  ],
};
export const DATA = [
  {
    title: "نصائح و إرشادات حول كيفية التعامل مع تلميذ يواجه صعوبات في التعلم ",
    img: "parent1.jpg",
    description: `حريّ بالمعلّمين أن يتعاملوا مع المشاعر السلبية الموجودة لدى العديد من التلاميذ ذوي الصعوبات التعلّم حول أنفسهم وحول قدرتهم على التعلّم في أغلب الأحيان, فهؤلاء التلاميذ يعتقدون بأنّهم لا يستطيعون التعلّم ولا يقتنعون بسهولةٍ بقدرتهم على احراز التقدّم والنجاح في التعلّم، من خلال جهدهم الخاص ونشاطاتهم وأفكارهم الاستراتيجية. وهناك مجموعة من التعليمات والنصائح لمعلّمي ذوي صعوبات التعلّم يمكن أن تساعدهم على التعامل مع هذه الفئة بكفاءةٍ وفاعلية وهي كالآتي:

        -تعلّم بقدر ما تستطيع حول الأنواع المختلفة لصعوبات التعلّم.
        
        -اغتنم الفرصة لإحداث فرقٍ هائل في حياة هذا التلميذ, وهذا معناه أن تكتشف مصادر القوة عند التلميذ وتؤكّد عليها, وأن تدعم اهتماماته.
        
        -اعطِ تغذيةً راجعة إيجابية للتلميذ, وأتح له بكثير من الفرص للممارسة العملية.
        
        -تكلّم مع الاختصاصيين في مدرستك مثل المرشد التربوي حول الطرائق الفعّالة لتعليم هذا التلميذ.
        
        -جَزّء المهام إلى خطواتٍ أصغر, واعطِ توجيهاتك شفهياً وكتابةً.
        
        -إعطاء وقت أكثر للطالب لإنهاء الأعمال المدرسية أو للإجابة عن الاختبارات.
        
        -اعطِ فرصةً للتلميذ لقراءة واستعمال الكتب الدراسية المسجلة على الأشرطة.
        
        -علّم التلميذ المهارات التنظيمية ، والمهارات الدراسية ، واستراتيجيات التعلّم ،فهذه الأمور تساعد الطلبة خاصّة ذوي صعوبات التعلّم.
        
        -اعمل مع آباء التلاميذ لإيجاد خطّة تربوية مضبوطة لتلبية حاجات التلميذ.
        
        -أسس علاقة عمل إيجابية مع أباء الطلبة من خلال الاتصال المنتظم, وتبادل المعلومات حول تقدّم التلميذ في المدرسة.
        
        -اطرح الأسئلة دائماً بطريقةٍ واضحة, ثم أسأل ذوي صعوبات التعلّم أن يصفوا لك ماذا فهموا من الأسئلة.
        
        -خفّض حجم المنهاج للتلميذ ذي صعوبات التعلّم. كرر بطريقةٍ لفظية ما يكتب على السبورة.
        
        -أزل مشتتات الانتباه من قاعة الدروس، مثل الضوضاء, أو الضوء البرّاق..، وغيرها.
        
        -تجنّب التعامل مع المفاهيم المجرّدة, استعمل أدوات بصرية مثل المخطّطات والرسوم البيانية.
        
        -شجّع الأسئلة من قبل صعوبات التعلّم أثناء أو بعد الدرس لضمان أنّ المادة مفهومة.
        
        -اعط مذكراتٍ فردية لتوجيه التلاميذ ذوي صعوبات التعلم لمراقبة تقدّمهم وفهمهم للمادة.
        
        -اعط كثيراً من التعزيز عندما تجد التلميذ ذي صعوبات التعلّم يحاول تعلّم أشياء تتعلّق بالصعوبة التي يعاني منها.
        
        -اعط التلميذ نشاطات بديلة للتمارين تناسب قدراته وتحقق أهداف الدرس نفسها.
        
        -تجنّب اللغة المعقّدة في أسئلة الامتحان.
        
        -اعط أشكالاً مختلفة من الاختبارات (شفهية, الكتاب المفتوح, بيتية) فبعض التلاميذ ذوي صعوبات التعلّم يكونون أكثر قدرةً على تأدية الامتحانات في شكل معين.
        
        -اسمح للتلاميذ ذوي الصعوبات التعلّم, باستعمال القاموس, أو الحاسبة أثناء الاختبارات ، أو أي وسيلةٍ أخرى.
        
        -اربط محتوى المادة بخبرات التلميذ اليومية.
        
        -ضع أهداف واقعية سواء أكانت قصيرة أم طويلة المدى. نوّع في أسلوب تعليمك.
        
        -علّم التلاميذ كيف يصححون أخطاءهم بأنفسهم.`,
  },
];
